app/controllers/tasks_controller.rb

    def index
        #index.html.erb内でも変数tasksが使えるように、前に@を付けている。
        # .allでテーブルに保存されているすべてのデータを配列で取得
        @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

    def create
        @task = Task.create(task_params)
---
INSERT INTO "tasks" ("title", "pass", "purpose", "urlink", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "あ"], ["pass", ""], ["purpose", ""], ["urlink", ""], ["created_at", "2020-12-29 16:37:47.404629"], ["updated_at", "2020-12-29 16:37:47.404629"]]

    def update
        @task = Task.find(params[:id])
        @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "pass" = ?, "purpose" = ?, "urlink" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["pass", "C:\\Program Files\\DB Browser for SQLite"], ["purpose", "Op"], ["urlink", "https://sqlitebrowser.org/dl/"], ["updated_at", "2021-01-11 15:03:20.386674"], ["id", 9]]